cheatsheets/cheatsheet_podman_support_for_kubernetes_yaml.org
:PROPERTIES:
:ID:       b1dab949-e7d3-47cb-a22c-4ef572298c94
:END:
#+TITLE:     Cheatsheet: Podman Support for Kubernetes YAML
#+AUTHOR:    David Conner
#+EMAIL:     aionfork@gmail.com
#+DESCRIPTION: notes

#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: title:nil author:nil c:nil d:(not "LOGBOOK") date:nil
#+OPTIONS: e:t email:nil f:t inline:t num:t p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t todo:t |:t
#+OPTIONS: toc:nil

#+SELECT_TAGS:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en

#+STARTUP: inlineimages

#+PROPERTY: header-args :eval never-export
# #+OPTIONS: texht:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,landscape]
#+LATEX_HEADER_EXTRA: \usepackage[margin=1.0in]{geometry}

This document outlines the kube yaml fields that are currently supported by the
*podman kube play* command. The notes were cross referenced with the Kubernetes
Docs, particularly the [[https://kubernetes.io/docs/reference/_print/][Greppable Reference]], where printable view make Ctrl-F go
vroom.

Not Supported ❌ Not Documented ❓Supported ✅ Only with multiple nodes ☑

* Pod Fields

[[https://kubernetes.io/docs/reference/_print/#PodSpec][PodSpec]]

|--------------------+----+---------+----|
| Field              |    | Field   |    |
|--------------------+----+---------+----|
| containers         | ✅ | os.name | ❌ |
| initContainers     | ✅ | volumes | ❌ |
| imagePullSecrets   | ❌ |         |    |
| enableServiceLinks | ❌ |         |    |
|--------------------+----+---------+----|

** Scheduling

[[https://kubernetes.io/docs/reference/_print/#kubescheduler-config-k8s-io-v1-KubeSchedulerConfiguration][KubeSchedulerConfiguration]]: has many [[https://kubernetes.io/docs/reference/_print/#kubescheduler-config-k8s-io-v1-KubeSchedulerProfile][profiles]], each identified by a
=schedulerName=. See also section on [[https://kubernetes.io/docs/reference/_print/#profiles][Scheduling Profiles]].

|---------------+---+-------------------+----+------------------+----|
| Field         |   | Field             |    | Field            |    |
|---------------+---+-------------------+----+------------------+----|
| nodeSelector  | ☑ | priority          | ❌ | preemptionPolicy | ❓ |
| nodeName      | ☑ | priorityClassName | ❌ | overhead         | ❓ |
| schedulerName | ☑ | runtimeClassName  | ❌ |                  |    |
|---------------+---+-------------------+----+------------------+----|

+ [[https://kubernetes.io/docs/reference/_print/#PriorityClass][PriorityClass]]
+ [[https://kubernetes.io/docs/reference/_print/#RuntimeClass][RuntimeClass]]

*** Affinity, Tolerations, Taints, Topology Spread Constraints

|-----------------+---+-------------------+---+-----------------------------+---|
| affinity.*      |   | tolerations.*     |   | topologySpreadConstraints.* |   |
|-----------------+---+-------------------+---+-----------------------------+---|
| nodeAffinity    | ☑ | key               | ☑ | maxSkew                     | ☑ |
| podAffinity     | ☑ | operator          | ☑ | topologyKey                 | ☑ |
| podAntiAffinity | ☑ | effect            | ☑ | whenUnsatisfiable           | ☑ |
|                 |   | tolerationSeconds | ☑ | labelSelector               | ☑ |
|                 |   |                   | ☑ | minDomains                  | ☑ |
|-----------------+---+-------------------+---+-----------------------------+---|

*** Lifecycle

|------------------------------+----|
| Field                        |    |
|------------------------------+----|
| restartPolicy                | ✅ |
| terminationGracePeriod       | ❌ |
| activeDeadlineSeconds        | ❌ |
| readinessGates.conditionType | ❌ |
|------------------------------+----|

** DNS

|-------------------+----+-----------------------+----+---------------+----|
| Field             |    | hostAliases.*         |    | dnsConfig.*   |    |
|-------------------+----+-----------------------+----+---------------+----|
| hostname          | ✅ | hostAliases.hostnames | ✅ | nameservers   | ✅ |
| setHostnameAsFQDN | ❌ | hostAliases.ip        | ✅ | options.name  | ✅ |
| subdomain         | ❌ |                       |    | options.value | ✅ |
| dnsPolicy         | ❌ |                       |    | searches      | ✅ |
|-------------------+----+-----------------------+----+---------------+----|

+ hostAliases :: only valid for non-hostNetwork pods.

** Security

Service Accounts

|------------------------------+----|
| Field                        |    |
|------------------------------+----|
| serviceAccountName           | ❌ |
| automountServiceAccountToken | ❌ |
|------------------------------+----|

