cheatsheets/cheatsheet_podman_support_for_kubernetes_yaml.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-14 Fri 05:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Podman: Support for Kubernetes YAML</title>
<meta name="description" content="notes" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<p>
This document outlines the kube yaml fields that are currently supported by the
<b>podman kube play</b> command. The notes were cross referenced with the Kubernetes
Docs, particularly the <a href="https://kubernetes.io/docs/reference/_print/">Greppable Reference</a>, where printable view make Ctrl-F go
vroom.
</p>

<p>
Not Supported ❌ Not Documented ❓Supported ✅ Only with multiple nodes ☑
</p>

<div id="outline-container-orgd987872" class="outline-2">
<h2 id="orgd987872"><span class="section-number-2">1.</span> Pod Fields</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://kubernetes.io/docs/reference/_print/#PodSpec">PodSpec</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">containers</td>
<td class="org-left">✅</td>
<td class="org-left">os.name</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">initContainers</td>
<td class="org-left">✅</td>
<td class="org-left">volumes</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">imagePullSecrets</td>
<td class="org-left">❌</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">enableServiceLinks</td>
<td class="org-left">❌</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org9b9ea1b" class="outline-3">
<h3 id="org9b9ea1b"><span class="section-number-3">1.1.</span> Scheduling</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://kubernetes.io/docs/reference/_print/#kubescheduler-config-k8s-io-v1-KubeSchedulerConfiguration">KubeSchedulerConfiguration</a>: has many <a href="https://kubernetes.io/docs/reference/_print/#kubescheduler-config-k8s-io-v1-KubeSchedulerProfile">profiles</a>, each identified by a
<code>schedulerName</code>. See also section on <a href="https://kubernetes.io/docs/reference/_print/#profiles">Scheduling Profiles</a>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">nodeSelector</td>
<td class="org-left">☑</td>
<td class="org-left">priority</td>
<td class="org-left">❌</td>
<td class="org-left">preemptionPolicy</td>
<td class="org-left">❓</td>
</tr>

<tr>
<td class="org-left">nodeName</td>
<td class="org-left">☑</td>
<td class="org-left">priorityClassName</td>
<td class="org-left">❌</td>
<td class="org-left">overhead</td>
<td class="org-left">❓</td>
</tr>

<tr>
<td class="org-left">schedulerName</td>
<td class="org-left">☑</td>
<td class="org-left">runtimeClassName</td>
<td class="org-left">❌</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><a href="https://kubernetes.io/docs/reference/_print/#PriorityClass">PriorityClass</a></li>
<li><a href="https://kubernetes.io/docs/reference/_print/#RuntimeClass">RuntimeClass</a></li>
</ul>
</div>

<div id="outline-container-org2104b39" class="outline-4">
<h4 id="org2104b39"><span class="section-number-4">1.1.1.</span> Affinity, Tolerations, Taints, Topology Spread Constraints</h4>
<div class="outline-text-4" id="text-1-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">affinity.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">tolerations.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">topologySpreadConstraints.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">nodeAffinity</td>
<td class="org-left">☑</td>
<td class="org-left">key</td>
<td class="org-left">☑</td>
<td class="org-left">maxSkew</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">podAffinity</td>
<td class="org-left">☑</td>
<td class="org-left">operator</td>
<td class="org-left">☑</td>
<td class="org-left">topologyKey</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">podAntiAffinity</td>
<td class="org-left">☑</td>
<td class="org-left">effect</td>
<td class="org-left">☑</td>
<td class="org-left">whenUnsatisfiable</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">tolerationSeconds</td>
<td class="org-left">☑</td>
<td class="org-left">labelSelector</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">☑</td>
<td class="org-left">minDomains</td>
<td class="org-left">☑</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgff15644" class="outline-4">
<h4 id="orgff15644"><span class="section-number-4">1.1.2.</span> Lifecycle</h4>
<div class="outline-text-4" id="text-1-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">restartPolicy</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">terminationGracePeriod</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">activeDeadlineSeconds</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">readinessGates.conditionType</td>
<td class="org-left">❌</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgb28960d" class="outline-3">
<h3 id="orgb28960d"><span class="section-number-3">1.2.</span> DNS</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">hostAliases.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">dnsConfig.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">hostname</td>
<td class="org-left">✅</td>
<td class="org-left">hostAliases.hostnames</td>
<td class="org-left">✅</td>
<td class="org-left">nameservers</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">setHostnameAsFQDN</td>
<td class="org-left">❌</td>
<td class="org-left">hostAliases.ip</td>
<td class="org-left">✅</td>
<td class="org-left">options.name</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">subdomain</td>
<td class="org-left">❌</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">options.value</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">dnsPolicy</td>
<td class="org-left">❌</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">searches</td>
<td class="org-left">✅</td>
</tr>
</tbody>
</table>

<dl class="org-dl">
<dt>hostAliases</dt><dd>only valid for non-hostNetwork pods.</dd>
</dl>
</div>
</div>

<div id="outline-container-org271e8c6" class="outline-3">
<h3 id="org271e8c6"><span class="section-number-3">1.3.</span> Security</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Service Accounts
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">serviceAccountName</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">automountServiceAccountToken</td>
<td class="org-left">❌</td>
</tr>
</tbody>
</table>
</div>
</div>
