cheatsheets/cheatsheet_podman_support_for_kubernetes_yaml.org
** Namespaces, sysctl and [[https://kubernetes.io/docs/tasks/administer-cluster/sysctl-cluster/][seccomp]] profiles

[[https://www.masteringemacs.org/article/whats-new-in-emacs-28-1][Emacs also supports seccomp profiles]], if you're paranoid and for some reason
compiling BPF programs isn't an undue time investment.

|-----------------------+----+---------------------------------+----|
| Field                 |    | securityContext.*               |    |
|-----------------------+----+---------------------------------+----|
| hostNetwork           | ✅ | seccompProfile.type             | ❌ |
| hostPID               | ✅ | seccompProfile.localhostProfile | ❌ |
| hostIPC               | ✅ | sysctls.name                    | ❌ |
| shareProcessNamespace | ✅ | sysctls.value                   | ❌ |
|-----------------------+----+---------------------------------+----|

** Volume/Process Ownership and SELinux

Other =securityContext.*= fields for =PodSpec=

|---------------------+----+-----------------------------------+----|
| securityContext.*   |    | securityContext.*                 |    |
|---------------------+----+-----------------------------------+----|
| runAsUser           | ✅ | seLinuxOptions.level              | ✅ |
| runAsNonRoot        | ❌ | seLinuxOptions.role               | ✅ |
| runAsGroup          | ✅ | seLinuxOptions.type               | ✅ |
| supplementalGroups  | ✅ | seLinuxOptions.user               | ✅ |
|---------------------+----+-----------------------------------+----|
| fsGroup             | ❌ | windowsOptions.gmsaCredentialSpec | ❌ |
| fsGroupChangePolicy | ❌ | windowsOptions.hostProcess        | ❌ |
|                     |    | windowsOptions.runAsUserName      | ❌ |
|---------------------+----+-----------------------------------+----|

+ fsGroup/ChangePolicy :: these pertain to whether a pod can change the
  ownership of volumes before "being exposed inside Pod." The former is a Group
  ID and =setgid= will be set, changing ownership of files created. The latter
  can only be set to =OnRootMismatch= or =Always=. Not entirely sure, but I
  wouldn't want to have to fix whatever this solves.

* Container Fields

|-----------------+----+-------------+----+---------------------+----+-----------+----|
| Name/Image      |    | Entry Point |    | Ports               |    | Debugging |    |
|-----------------+----+-------------+----+---------------------+----+-----------+----|
| name            | ✅ | command     | ✅ | ports.containerPort | ✅ | stdin     | ❌ |
| image           | ✅ | args        | ✅ | ports.hostIP        | ✅ | stdinOnce | ❌ |
| imagePullPolicy | ✅ | workingDir  | ✅ | ports.hostPort      | ✅ | tty       | ❌ |
|                 |    |             |    | ports.name          | ✅ |           |    |
|                 |    |             |    | ports.protocol      | ✅ |           |    |
|-----------------+----+-------------+----+---------------------+----+-----------+----|

** Env References

Either set =env.value= or supply a reference source with =env.valueFrom=, which
needs a corresponding =envFrom.*= source

|-------+----+------------------+----+--------------------------+----+-----------------------+----|
| env.* |    | env.valueFrom.*  |    | env.valueFrom.*          |    | env.valueFrom.*       |    |
|-------+----+------------------+----+--------------------------+----+-----------------------+----|
| name  | ✅ | fieldRef         | ✅ | configMapKeyRef.key      | ✅ | secretKeyRef.key      | ✅ |
| value | ✅ | resourceFieldRef | ✅ | configMapKeyRef.name     | ✅ | secretKeyRef.name     | ✅ |
|       |    |                  |    | configMapKeyRef.optional | ✅ | secretKeyRef.optional | ✅ |
|-------+----+------------------+----+--------------------------+----+-----------------------+----|

*env.valueFrom.fieldRef*

+ Composed of fieldPath & apiVersion ([[https://kubernetes.io/docs/reference/kubernetes-api/common-definitions/object-field-selector/#ObjectFieldSelector][ObjectFieldSelector]])
+ Selects a field of the pod
+ Only annotations, labels, name and namespace are supported.

*env.valueFrom.resourceFieldRef*

+ Composed of resource, containerName, divisor ([[https://kubernetes.io/docs/reference/kubernetes-api/common-definitions/resource-field-selector/#ResourceFieldSelector][ResourceFieldSelector]])
+ Selects a resource of the container
+ Only resources limits and requests (limits.cpu, limits.memory, requests.cpu
  and requests.memory) are currently supported.

** Env Sources

|-----------+----+-----------------------+----+--------------------+----|
| envFrom.* |    | envFrom.*             |    | env.*              |    |
|-----------+----+-----------------------+----+--------------------+----|
| prefix    | ❌ | configMapRef.name     | ✅ | secretRef.name     | ✅ |
|           |    | configMapRef.optional | ✅ | secretRef.optional | ✅ |
|-----------+----+-----------------------+----+--------------------+----|

