cheatsheets/cheatsheet_podman_support_for_kubernetes_yaml.html

<div id="outline-container-org7b50f26" class="outline-3">
<h3 id="org7b50f26"><span class="section-number-3">1.4.</span> Namespaces, sysctl and <a href="https://kubernetes.io/docs/tasks/administer-cluster/sysctl-cluster/">seccomp</a> profiles</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="https://www.masteringemacs.org/article/whats-new-in-emacs-28-1">Emacs also supports seccomp profiles</a>, if you're paranoid and for some reason
compiling BPF programs isn't an undue time investment.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">securityContext.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">hostNetwork</td>
<td class="org-left">✅</td>
<td class="org-left">seccompProfile.type</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">hostPID</td>
<td class="org-left">✅</td>
<td class="org-left">seccompProfile.localhostProfile</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">hostIPC</td>
<td class="org-left">✅</td>
<td class="org-left">sysctls.name</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">shareProcessNamespace</td>
<td class="org-left">✅</td>
<td class="org-left">sysctls.value</td>
<td class="org-left">❌</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4b6b26a" class="outline-3">
<h3 id="org4b6b26a"><span class="section-number-3">1.5.</span> Volume/Process Ownership and SELinux</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Other <code>securityContext.*</code> fields for <code>PodSpec</code>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">securityContext.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">securityContext.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">runAsUser</td>
<td class="org-left">✅</td>
<td class="org-left">seLinuxOptions.level</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">runAsNonRoot</td>
<td class="org-left">❌</td>
<td class="org-left">seLinuxOptions.role</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">runAsGroup</td>
<td class="org-left">✅</td>
<td class="org-left">seLinuxOptions.type</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">supplementalGroups</td>
<td class="org-left">✅</td>
<td class="org-left">seLinuxOptions.user</td>
<td class="org-left">✅</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fsGroup</td>
<td class="org-left">❌</td>
<td class="org-left">windowsOptions.gmsaCredentialSpec</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">fsGroupChangePolicy</td>
<td class="org-left">❌</td>
<td class="org-left">windowsOptions.hostProcess</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">windowsOptions.runAsUserName</td>
<td class="org-left">❌</td>
</tr>
</tbody>
</table>

<dl class="org-dl">
<dt>fsGroup/ChangePolicy</dt><dd>these pertain to whether a pod can change the
ownership of volumes before "being exposed inside Pod." The former is a Group
ID and <code>setgid</code> will be set, changing ownership of files created. The latter
can only be set to <code>OnRootMismatch</code> or <code>Always</code>. Not entirely sure, but I
wouldn't want to have to fix whatever this solves.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgc92f7fa" class="outline-2">
<h2 id="orgc92f7fa"><span class="section-number-2">2.</span> Container Fields</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name/Image</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Entry Point</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Ports</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Debugging</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-left">✅</td>
<td class="org-left">command</td>
<td class="org-left">✅</td>
<td class="org-left">ports.containerPort</td>
<td class="org-left">✅</td>
<td class="org-left">stdin</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">image</td>
<td class="org-left">✅</td>
<td class="org-left">args</td>
<td class="org-left">✅</td>
<td class="org-left">ports.hostIP</td>
<td class="org-left">✅</td>
<td class="org-left">stdinOnce</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">imagePullPolicy</td>
<td class="org-left">✅</td>
<td class="org-left">workingDir</td>
<td class="org-left">✅</td>
<td class="org-left">ports.hostPort</td>
<td class="org-left">✅</td>
<td class="org-left">tty</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ports.name</td>
<td class="org-left">✅</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ports.protocol</td>
<td class="org-left">✅</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgc81cf20" class="outline-3">
<h3 id="orgc81cf20"><span class="section-number-3">2.1.</span> Env References</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Either set <code>env.value</code> or supply a reference source with <code>env.valueFrom</code>, which
needs a corresponding <code>envFrom.*</code> source
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">env.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">env.valueFrom.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">env.valueFrom.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">env.valueFrom.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-left">✅</td>
<td class="org-left">fieldRef</td>
<td class="org-left">✅</td>
<td class="org-left">configMapKeyRef.key</td>
<td class="org-left">✅</td>
<td class="org-left">secretKeyRef.key</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">value</td>
<td class="org-left">✅</td>
<td class="org-left">resourceFieldRef</td>
<td class="org-left">✅</td>
<td class="org-left">configMapKeyRef.name</td>
<td class="org-left">✅</td>
<td class="org-left">secretKeyRef.name</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">configMapKeyRef.optional</td>
<td class="org-left">✅</td>
<td class="org-left">secretKeyRef.optional</td>
<td class="org-left">✅</td>
</tr>
</tbody>
</table>

<p>
<b>env.valueFrom.fieldRef</b>
</p>

<ul class="org-ul">
<li>Composed of fieldPath &amp; apiVersion (<a href="https://kubernetes.io/docs/reference/kubernetes-api/common-definitions/object-field-selector/#ObjectFieldSelector">ObjectFieldSelector</a>)</li>
<li>Selects a field of the pod</li>
<li>Only annotations, labels, name and namespace are supported.</li>
</ul>

<p>
<b>env.valueFrom.resourceFieldRef</b>
</p>

<ul class="org-ul">
<li>Composed of resource, containerName, divisor (<a href="https://kubernetes.io/docs/reference/kubernetes-api/common-definitions/resource-field-selector/#ResourceFieldSelector">ResourceFieldSelector</a>)</li>
<li>Selects a resource of the container</li>
<li>Only resources limits and requests (limits.cpu, limits.memory, requests.cpu
and requests.memory) are currently supported.</li>
</ul>
</div>
</div>

<div id="outline-container-org60c568c" class="outline-3">
<h3 id="org60c568c"><span class="section-number-3">2.2.</span> Env Sources</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">envFrom.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">envFrom.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">env.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">prefix</td>
<td class="org-left">❌</td>
<td class="org-left">configMapRef.name</td>
<td class="org-left">✅</td>
<td class="org-left">secretRef.name</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">configMapRef.optional</td>
<td class="org-left">✅</td>
<td class="org-left">secretRef.optional</td>
<td class="org-left">✅</td>
</tr>
</tbody>
</table>
</div>
</div>
