cheatsheets/cheatsheet_podman_support_for_kubernetes_yaml.org
** Volumes, Devices and Resources

|----------------+----+------------------+----+----------------+----+-----------------+----+-------------+----|
| volumeMounts.* |    | volumeMounts.*   |    | volumeMounts.* |    | volumeDevices.* |    | resources.* |    |
|----------------+----+------------------+----+----------------+----+-----------------+----+-------------+----|
| name           | ✅ | mountPath        | ✅ | subPath        | ❌ | devicePath      | ❌ | limits      | ✅ |
| readOnly       | ✅ | mountPropagation | ❌ | subPathExpr    | ❌ | name            | ❌ | requests    | ✅ |
|----------------+----+------------------+----+----------------+----+-----------------+----+-------------+----|

** Lifecycle, Termination and Probes

|---------------------+----+--------------------------+----+----------------+----|
| [[https://kubernetes.io/docs/reference/kubernetes-api/workload-resources/pod-v1/#LifecycleHandler][LifecycleHandler]]    |    | TerminationMessage       |    | [[https://kubernetes.io/docs/reference/kubernetes-api/workload-resources/pod-v1/#Probe][Probe]]          |    |
|---------------------+----+--------------------------+----+----------------+----|
| lifecycle.postStart | ❌ | terminationMessagePath   | ❌ | livenessProbe  | ✅ |
| lifecycle.preStop   | ❌ | terminationMessagePolicy | ❌ | readinessProbe | ❌ |
|                     |    |                          |    | startupProbe   | ❌ |
|---------------------+----+--------------------------+----+----------------+----|

For the termination message, the *path* is the mounted file to which the
container's termination message will be written and the *policy* indicates how
the termination message should be populated.

|------------------------------+----+------------------------------------------+----|
| securityContext.*            |    | securityContext.*                        |    |
|------------------------------+----+------------------------------------------+----|
| securityContext.runAsUser    | ✅ | securityContext.readOnlyRootFilesystem   | ✅ |
| securityContext.runAsNonRoot | ❌ | securityContext.procMount                | ❌ |
| securityContext.runAsGroup   | ✅ | securityContext.privileged               | ✅ |
|                              |    | securityContext.allowPrivilegeEscalation | ✅ |
|------------------------------+----+------------------------------------------+----|

*** Capabilities and Seccomp

securityContext.*

|-------------------+----+---------------------+----|
| sc.capabilities.* |    | sc.seccompProfile.* |    |
|-------------------+----+---------------------+----+-
| add               | ✅ | type                | ❌ |
| drop              | ✅ | localhostProfile    | ❌ |
|-------------------+----+---------------------+----+-

*** SELinux and Windows

securityContext.*

|---------------------+----+---------------------+----|
| sc.seLinuxOptions.* |    | sc.windowsOptions.* |    |
|---------------------+----+---------------------+----|
| level               | ✅ | gmsaCredentialSpec  | ❌ |
| role                | ✅ | hostProcess         | ❌ |
| type                | ✅ | runAsUserName       | ❌ |
| user                | ✅ |                     |    |
|---------------------+----+---------------------+----|

* PersistentVolumeClaim Fields

|------------------+----+-------------+----|
| Field            |    | resouces.*  |    |
|------------------+----+-------------+----|
| volumeName       | ❌ | limits      | ❌ |
| storageClassName | ✅ | requests    | ✅ |
| volumeMode       | ❌ | claims.name | ❓ |
| accessModes      | ✅ |             |    |
| selector         | ❌ |             |    |
|------------------+----+-------------+----|

* ConfigMap Fields

|------------+----|
| Field      |    |
|------------+----|
| binaryData | ✅ |
| data       | ✅ |
| immutable  | ❌ |
|------------+----|

* Deployment Fields

|----------------------+----+---------------------------------------+----|
| Field                |    | Field                                 |    |
|----------------------+----+---------------------------------------+----|
| replicas             | ✅ | minReadySeconds                       | ❌ |
| selector             | ✅ | progressDeadlineSeconds               | ❌ |
| template             | ✅ | strategy.type                         | ❌ |
| revisionHistoryLimit | ❌ | strategy.rollingUpdate.maxSurge       | ❌ |
| paused               | ❌ | strategy.rollingUpdate.maxUnavailable | ❌ |
|----------------------+----+---------------------------------------+----|

+ (Podman) For =replicas= the actual replica count is ignored and set to 1
