cheatsheets/cheatsheet_podman_support_for_kubernetes_yaml.html

<div id="outline-container-org1cb0e93" class="outline-3">
<h3 id="org1cb0e93"><span class="section-number-3">2.3.</span> Volumes, Devices and Resources</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">volumeMounts.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">volumeMounts.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">volumeMounts.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">volumeDevices.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">resources.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-left">✅</td>
<td class="org-left">mountPath</td>
<td class="org-left">✅</td>
<td class="org-left">subPath</td>
<td class="org-left">❌</td>
<td class="org-left">devicePath</td>
<td class="org-left">❌</td>
<td class="org-left">limits</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">readOnly</td>
<td class="org-left">✅</td>
<td class="org-left">mountPropagation</td>
<td class="org-left">❌</td>
<td class="org-left">subPathExpr</td>
<td class="org-left">❌</td>
<td class="org-left">name</td>
<td class="org-left">❌</td>
<td class="org-left">requests</td>
<td class="org-left">✅</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc69001b" class="outline-3">
<h3 id="orgc69001b"><span class="section-number-3">2.4.</span> Lifecycle, Termination and Probes</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><a href="https://kubernetes.io/docs/reference/kubernetes-api/workload-resources/pod-v1/#LifecycleHandler">LifecycleHandler</a></th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">TerminationMessage</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><a href="https://kubernetes.io/docs/reference/kubernetes-api/workload-resources/pod-v1/#Probe">Probe</a></th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">lifecycle.postStart</td>
<td class="org-left">❌</td>
<td class="org-left">terminationMessagePath</td>
<td class="org-left">❌</td>
<td class="org-left">livenessProbe</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">lifecycle.preStop</td>
<td class="org-left">❌</td>
<td class="org-left">terminationMessagePolicy</td>
<td class="org-left">❌</td>
<td class="org-left">readinessProbe</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">startupProbe</td>
<td class="org-left">❌</td>
</tr>
</tbody>
</table>

<p>
For the termination message, the <b>path</b> is the mounted file to which the
container's termination message will be written and the <b>policy</b> indicates how
the termination message should be populated.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">securityContext.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">securityContext.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">securityContext.runAsUser</td>
<td class="org-left">✅</td>
<td class="org-left">securityContext.readOnlyRootFilesystem</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">securityContext.runAsNonRoot</td>
<td class="org-left">❌</td>
<td class="org-left">securityContext.procMount</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">securityContext.runAsGroup</td>
<td class="org-left">✅</td>
<td class="org-left">securityContext.privileged</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">securityContext.allowPrivilegeEscalation</td>
<td class="org-left">✅</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org4756ce8" class="outline-4">
<h4 id="org4756ce8"><span class="section-number-4">2.4.1.</span> Capabilities and Seccomp</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
securityContext.*
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sc.capabilities.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">sc.seccompProfile.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">add</td>
<td class="org-left">✅</td>
<td class="org-left">type</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">drop</td>
<td class="org-left">✅</td>
<td class="org-left">localhostProfile</td>
<td class="org-left">❌</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org977dd23" class="outline-4">
<h4 id="org977dd23"><span class="section-number-4">2.4.2.</span> SELinux and Windows</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
securityContext.*
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sc.seLinuxOptions.*</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">sc.windowsOptions.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">level</td>
<td class="org-left">✅</td>
<td class="org-left">gmsaCredentialSpec</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">role</td>
<td class="org-left">✅</td>
<td class="org-left">hostProcess</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">type</td>
<td class="org-left">✅</td>
<td class="org-left">runAsUserName</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">✅</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-org7106567" class="outline-2">
<h2 id="org7106567"><span class="section-number-2">3.</span> PersistentVolumeClaim Fields</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">resouces.*</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">volumeName</td>
<td class="org-left">❌</td>
<td class="org-left">limits</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">storageClassName</td>
<td class="org-left">✅</td>
<td class="org-left">requests</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">volumeMode</td>
<td class="org-left">❌</td>
<td class="org-left">claims.name</td>
<td class="org-left">❓</td>
</tr>

<tr>
<td class="org-left">accessModes</td>
<td class="org-left">✅</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">selector</td>
<td class="org-left">❌</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7a1371a" class="outline-2">
<h2 id="org7a1371a"><span class="section-number-2">4.</span> ConfigMap Fields</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">binaryData</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">data</td>
<td class="org-left">✅</td>
</tr>

<tr>
<td class="org-left">immutable</td>
<td class="org-left">❌</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org229eafc" class="outline-2">
<h2 id="org229eafc"><span class="section-number-2">5.</span> Deployment Fields</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">replicas</td>
<td class="org-left">✅</td>
<td class="org-left">minReadySeconds</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">selector</td>
<td class="org-left">✅</td>
<td class="org-left">progressDeadlineSeconds</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">template</td>
<td class="org-left">✅</td>
<td class="org-left">strategy.type</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">revisionHistoryLimit</td>
<td class="org-left">❌</td>
<td class="org-left">strategy.rollingUpdate.maxSurge</td>
<td class="org-left">❌</td>
</tr>

<tr>
<td class="org-left">paused</td>
<td class="org-left">❌</td>
<td class="org-left">strategy.rollingUpdate.maxUnavailable</td>
<td class="org-left">❌</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>(Podman) For <code>replicas</code> the actual replica count is ignored and set to 1</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-07-14 Fri 05:07</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>